Repository: 84000/data-translation-memory
Catalog: toh136-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་མེད་སྲོག་ཆགས་ཉིས་འབུམ་གྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་ཞབས་ལ་ཕྱག་འཚལ་བའི་ཕྱིར་བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་ནས་བྱུང་སྟེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་ངོ་། །བཅོམ་ལྡན་འདས་སེང་གེའི་གཟིམས་ཁྲི་ལ་སྐུའི་གློ་གཡས་པས་ཕབ་སྟེ།
en: Then the bodhisattva great being Without Reference, escorted by an entourage of two hundred thousand creatures, left the great city of Vārāṇasī and journeyed to where the Blessed One was, to pay homage at the feet of the Blessed One.

source: གཟིམས་མ་ཐག་ཏུ་དེ་ནས་སྐད་ཅིག་དེ་དང་། ཐང་ཅིག་དེ་དང་། ཡུད་ཙམ་དེ་ལ་བྱང་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་འདས་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱང་ཆུབ་ཡན་ལག་གནས་ཞེས་བྱ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་ཅན་ཞེས་བྱ་བ་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཐོབ་པ་ཞེས་བྱ་བ་ཤི་འཕོས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་འཛམ་བུའི་གླིང་འདི་ཉིད་དུ་ཡངས་པ་ཅན་གྱི་གྲོང་ཁྱེར་ཆེན་པོར་དམག་དཔོན་སེང་གེ་ཞེས་བྱ་བའི་ཁྱིམ་དུ་སྐྱེས་སོ། །
en: As soon as the Blessed One had lain down on his right side upon the lion couch, at that moment, right then, at that very instant, sixty-four trillion buddha fields away to the north in the world called Puṣpavatī, the buddha field of the thus-gone, worthy, perfect buddha called Resting in the Branches of Awakening, the bodhisattva great being called Flower of Clairvoyance passed away and was reborn in this buddha field of Jambudvīpa, in the great city of Vaiśālī, into the household of the general Siṃha.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཐོབ་པ་དེ་སྐྱེས་མ་ཐག་ཏུ་ཆེད་དུ་བརྗོད་པ་འདི་སྐད་དུ་བརྗོད་དོ། །གང་གིས་སེམས་ཅན་བྱེ་མང་རྣམས། །ཉོན་མོངས་གྱུར་པ་ཐར་མཛད་ཅིང་། །ཤཱཀྱའི་རིགས་རྣམས་དགའ་མཛད་པ། །རྫོགས་པའི་སངས་རྒྱས་བཞུགས་སམ་ཅི། །
en: As soon as the bodhisattva great being Flower of Clairvoyance was born, he spoke up, and he spoke with purpose: “He who liberates Millions of afflicted beings, Who delights the Śākya clan— The perfect Buddha—is he still here?

source: བརྩོན་པས་ཕ་རོལ་གཤེགས་གྱུར་ཅིང་། །ཡེ་ཤེས་འཕྲིན་ལས་མཉམ་བཞག་ལ། །མཁྱེན་པ་རྒྱ་མཚོ་མཐའ་ཡས་པ། །རྫོགས་པའི་སངས་རྒྱས་བཞུགས་སམ་ཅི། །
en: “He who through exertion has crossed to the far shore, Who has mastered wisdom, activity, and equipoise, That infinite ocean of knowledge— The perfect Buddha—is he still here?

source: ཞི་བའི་ཐུགས་མངའ་བཟོད་པ་བརྙེས། །ཟུག་རྔུ་འབྱིན་མཛད་དེ་བཞིན་གཤེགས། །སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཀྱང་། །ཆོས་དེ་རློམ་པར་མི་མཛད་པ། །རྫོགས་པའི་སངས་རྒྱས་བཞུགས་སམ་ཅི། །
en: “He whose mind is at peace, who has found acceptance, The Thus-Gone remover of painful thorns Who teaches the Dharma to beings But does not do so with conceit— The perfect Buddha—is he still here?

source: འཇིག་རྟེན་གསུམ་ན་མི་གནས་ཀྱང་། །གང་གིས་འདོད་ཁམས་གཟུགས་ཁམས་དང་། །གཟུགས་མེད་ཁམས་ནི་མ་ལུས་པར། །མཁྱེན་པས་གཞལ་བར་མཛད་གྱུར་པ། །སྤྱན་དང་ལྡན་པ་བཞུགས་སམ་ཅི། །
en: “He who does not abide in the three worlds But in his wisdom comprehends The desire, form, and formless realms in their entirety— The one who sees—is he still here?”

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་ཡན་ལག་གནས་ཞེས་བྱ་བས་སྐུ་ལྷའི་ཆ་བྱད་དུ་མངོན་པར་སྤྲུལ་ནས་ཁྱེའུ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། རྫོགས་པའི་སངས་རྒྱས་བསྐལ་པའམ། །དེ་བས་ལྷག་པར་བཞུགས་འགྱུར་བས། །ཕྱིས་ཀྱང་རྫོགས་སངས་མཐོང་འགྱུར་གྱིས། །འདོད་པས་དགའ་བར་གྱིས་ཤིག་ཁྱེའུ། །
en: Then the thus-gone one called Resting in the Branches of Awakening manifested in the form of a god, and he spoke to the boy in verse: “Since perfect buddhas live for an eon, Or perhaps even more, You will see the perfect buddha again, So enjoy yourself, child!

source: འདི་ནི་རྒྱལ་ཆེན་ཁྱིམ་ཡིན་གྱིས། །འདོད་པའི་དགའ་མཆོག་སྤྱོད་བྱོས་ལ། །སད་ནས་པི་ཝང་རྔ་ཆེན་དང་། །
en: “This is a royal household, So enjoy the greatest of luxuries.

source: རྫ་རྔ་རྣམས་དང་འཁར་སིལ་རྡོབས། །
en: From the moment you wake, Let lutes and drums, large and small, resound!”

source: དེ་ནས་ཁྱེའུ་དེས་དེ་བཞིན་གཤེགས་པ་ཡིན་པ་ཁོ་ནར་ཤེས་མོད་ཀྱི་ལྷ་ཡིན་པར་འདུ་ཤེས་པའི་སེམས་ཅན་གཞན་དག་གི་དགེ་བའི་རྩ་བ་ཡང་དག་པར་བསྐྱེད་པའི་ཕྱིར་ཚིགས་སུ་བཅད་པ་སྨྲས་པ། སེམས་ཅན་གང་དག་འདོད་དབང་སོང་། །དེ་དག་བྱིས་པ་རྨོངས་པ་ཡིན། །
en: Then the child, though he understood that this was none other than the Thus-Gone One, for the sake of generating roots of virtue in those other beings who perceived him as a god, spoke these verses: “Those under the sway of desires Are foolish and deluded.

source: དེ་དག་གིས་ནི་རྫོགས་སངས་དང་། །སངས་རྒྱས་བསྟན་པ་མི་ཤེས་སོ། །
en: They know neither the perfect Buddha Nor the Buddha’s teachings.

source: འདོད་རྣམས་སྙིང་པོ་མེད་པས་ན། །འདོད་པའི་ལོངས་སྤྱོད་བདག་མི་འདོད། །
en: “Since the objects of desire are without essence, I have no desire to indulge them.

source: འདོད་པ་སྤུ་གྲིའི་སོ་འདྲ་བས། །འདོད་པ་དེ་ལ་སུ་ཡིད་རྟོན། །
en: Desire is like the edge of a razor— Who can trust their desires?

source: ཁྱི་དང་ཕག་དང་ཝ་དག་དང་། །བ་ལང་བོང་བུ་དྲེའུ་རྟ་དག །དེ་དག་འདོད་པ་སྟེན་བྱེད་ཀྱི། །སངས་རྒྱས་མི་མཛད་ཉན་ཐོས་མིན། །
en: “Dogs, pigs, and foxes, Oxen, asses, and mules, Rely on their desires, But they do not become buddhas, nor their disciples.

source: ཞར་བ་ཐེང་བོ་ལོང་བ་དང་། །གླེན་པ་སྒུར་པོ་མིའུ་ཐུང་རྣམས། །དེ་དག་འདོད་པ་སྟེན་བྱེད་ཀྱི། །སངས་རྒྱས་མི་མཛད་ཉན་ཐོས་མིན། །
en: “The crippled, the lame, and the blind, Idiots, hunchbacks, and dwarves, Rely on their desires, But they do not become buddhas, nor their disciples.

source: སྦྲང་བུ་སྦུར་བ་ཕྱེ་ལེབ་དང་། དེ་བཞིན་རྨ་བྱ་ཁུ་བྱུག་རྣམས། །དེ་དག་འདོད་ལ་སྟེན་བྱེད་པས། །ཁོ་བོ་ཁྱད་པར་མེད་པར་འགྱུར། །
en: “Bees, beetles, and butterflies, Peacocks and cuckoos, too, Rely on their desires, So I would be no different from them.

source: ཇི་ལྟར་མེ་ཡི་ཀླུབས་ཀྱིས་ནི། །འཛམ་བུའི་གླིང་འདི་གང་གྱུར་ན། །ལོང་བ་དེར་ནི་ལྟུང་བ་ལྟར། །རྒྱལ་བ་འདོད་པར་དེ་བཞིན་ནོ། །
en: “Victor, desire is like A raging inferno That engulfs the entire world, Into which the blind do fall.

source: འདོད་པ་མི་རྟག་སྡུག་བསྔལ་བས། །སུ་ཞིག་འདོད་པ་སྟེན་པར་བྱེད། །
en: “Desires are ephemeral and painful, So who can rely on them?

source: གང་དག་འདོད་པའི་རྗེས་འབྲང་བས། །དེ་དག་དེ་ཡི་ཆོས་མི་ཤེས། །
en: Those who follow their desires Do not understand the Dharma.

source: ཁོ་བོ་འདོད་པ་མི་གཉེར་བར། །སངས་རྒྱས་ཀྱིས་ནི་ཁོ་བོ་མཁྱེན། །
en: “The buddhas know me As one with no interest in desire.

source: ལྷར་གྱུར་བདག་ལ་འདྲི་བ་འདི། །སངས་རྒྱས་ཡིན་པར་ཁོ་བོས་ཤེས། །
en: I know that this being in the form of a god Who tests me is a buddha.

source: བདག་གིས་སངས་རྒྱས་སྐྱོབ་པ་ནི། །ལྷུན་པོའི་རྒྱལ་ལས་འདི་སྐད་ཅེས། །
en: “I heard the gods of Sumeru talking About the Buddha, the protector.

source: མཚན་མོའི་ཐུན་གྱི་ཐ་མ་ལ། །སངས་རྒྱས་འདའ་བར་འགྱུར་ཞེས་ཐོས། །
en: ‘In the last watch of the night,’ they said, ‘The Buddha will pass away.’

source: ཀུན་སྦྱོར་ཟད་པའི་དྲང་སྲོང་ལ། །གང་དག་ལྟ་བར་འདོད་པ་དག །
en: “All those who wish to behold the sage, He who has exhausted all fetters, come along!

source: ཀྱེ་མ་སྟོན་པ་འདས་གྱུར་གྱིས། །
en: Alas! The teacher is passing into nirvāṇa!

source: ཚུར་ཤོག་སངས་རྒྱས་བལྟ་ཕྱིར་འདོང་། །
en: Let us go and see the Buddha.

source: སྐྱོབ་པ་ཤཱཀྱ་སེང་གེ་ནི། །མྱ་ངན་འདའ་བར་འགྱུར་བའི་ཚེ། །གང་གིས་མཐོང་ཞིང་ཐོས་གྱུར་པས། །དགེ་བ་མང་པོ་བྱེད་འགྱུར་ལྟར། །
en: “Those who are able to see and hear The protector, the lion of the Śākyas, As he passes into nirvāṇa Will reap tremendous virtue.

source: དེས་ནི་བསྐལ་པ་བྱེ་སྟོང་དུ། །དགེ་བ་བྱས་པ་མ་ཡིན་ཞེས། །
en: “ ‘Such virtue cannot be accrued Over a billion eons.’

source: བྱང་ཆུབ་ཡན་ལག་གནས་མཛད་པ། །བདེ་གཤེགས་མི་མཆོག་དེ་སྐད་གསུངས། །
en: This, Resting in the Branches of Awakening, Is what the well-gone, the best of men has said.

source: གང་དག་སྟོན་ལ་དགའ་བ་ཡི། །ལྷ་དང་གནོད་སྦྱིན་མི་རྣམས་དག །གྲགས་ཆེན་རྫོགས་པའི་སངས་རྒྱས་ལ། །བལྟ་ཕྱིར་མྱུར་དུ་ཚུར་ཤོག་ཅིག །
en: “Those who find joy in the teachings— Gods, yakṣas, and humans— Come quickly with me now, To see the renowned and perfect Buddha!”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཐོབ་པ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་བའི་སྲོག་ཆགས་འབུམ་ཕྲག་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་། མདུན་དུ་བདར་ཏེ། ཡངས་པ་ཅན་གྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་ནས།
en: Then the bodhisattva great being Flower of Clairvoyance, escorted by an entourage of many hundreds of thousands of beings who pay homage at the feet of the Blessed One, left the great city of Vaiśālī and journeyed to where the Blessed One was.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་ངོ་།། །།བམ་པོ་གཉིས་པ། བཅོམ་ལྡན་འདས་སེང་གེའི་གཟིམས་ཁྲི་ལ་སྐུའི་གློ་གཡས་པས་ཕབ་སྟེ་གཟིམས་མ་ཐག་ཏུ་དེ་ནས་ཁྱེའུ་བཞི་པོ་མཉམ་ཞིང་མི་མཉམ་པ་མེད་ལ། སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཙམ་ཡང་ལྷག་ཆད་མེད་པའི་ཆོས་དང་ལྡན་པ་དེ་དག་ཕྱོགས་བཞི་ནས་བཅོམ་ལྡན་འདས་ལ་ཐལ་མོ་སྦྱོར་ཞིང་ཕྱག་འཚལ་བའི་སྐྱེ་བོ་ཕལ་པོ་ཆེས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་ངོ་། །
en: As soon as the Blessed One had lain down on his right side upon the lion couch, the four boys—neither the same nor not the same, possessed of qualities without a hair’s breadth of difference—arrived from the four directions into the presence of the Blessed One, each escorted by a multitude of beings paying homage with folded hands to the Blessed One.

source: ཁྱེའུ་བཞི་པོ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་དོང་བའི་ཚེ་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་གི་སྲོག་ཆགས་འབུམ་ཕྲག་མང་པོ་རྣམས་སེམས་རབ་ཏུ་དང་ཞིང་ཡིད་བསྡུས་ནས་ཐལ་མོ་སྦྱར་ཏེ་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱས་སོ། །
en: As the four boys came before the Blessed One, a crowd of many hundreds of thousands of people gathered from the villages, cities, markets, surrounding countryside, and royal palaces and welcomed them with folded hands.

source: དེ་དག་དོང་བའི་ཚེ་ཕྱོགས་བཞིར་དཔག་ཚད་གཅིག་ཙམ་གྱི་ཁོ་ར་ཁོར་ཡུག་ཏུ་མེ་ཏོག་གི་ཆར་དག་མངོན་པར་རབ་ཏུ་བབ་པོ། །
en: As they approached, a thick rain of flowers fell over the whole area for about a league in all four directions.

source: དེ་དག་དོང་བའི་ཚེ་ལྷ་རྣམས་ཀྱིས་ལྷའི་སིལ་སྙན་བརྒྱ་སྟོང་དག་མངོན་པར་རབ་ཏུ་གསིལ་ཅིང་ལྷའི་གླུ་དབྱངས་ཀྱི་སྒྲ་དག་ཀྱང་ཕྱུང་ངོ་། །
en: As they approached, divine music resounded as the gods played hundreds and thousands of celestial instruments and sang melodious songs.

source: དེའི་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཕྱོགས་བཞིར་སེང་གེའི་གཟིམས་ཁྲི་བཤམས་པ་བཞི་ཡང་བྱུང་བར་གྱུར་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: At that moment, four more well-prepared lion couches sprang up in the four cardinal directions around the thus-gone, worthy, perfect Buddha.

source: ཐམས་ཅད་མཁྱེན་པའི་ཕྱོགས་བཞི་ན། །སེང་གེའི་གཟིམས་ཁྲི་འཐུན་པ་དང་། །རྣམ་པར་མཛེས་པ་འདི་འདྲ་བ། །གང་གི་རྒྱུ་ལགས་བཅོམ་ལྡན་འདས། །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Venerable Ānanda then asked the Blessed One in verse: “Why, Blessed One, Have beautiful and well-prepared lion couches Sprung up in the four directions Around the omniscient one?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཕྱོགས་བཞི་ནས་འོང་བའི་ཁྱེའུ་བཞིན་རས་ཟླ་བའི་དཀྱིལ་འཁོར་འདྲ་ཞིང་ཉི་མའི་འོད་ཟེར་ལས་ཡང་དག་པར་འདས་པའི་འོད་ཀྱིས་གླིང་བཞི་ཟིལ་གྱིས་གནོན་པ། གཟུགས་དང་། གཟི་བརྗིད་ཀྱི་འོད་གསལ་བ། ཤེས་རབ་ཀྱི་སྣང་བ་ཐོབ་པ། བརྩོན་འགྲུས་ཐོབ་པ། ཡེ་ཤེས་ཟབ་མོ་རྗེས་སུ་རྟོགས་པ། དཔལ་དང་ལྡན་པ། བློ་དང་ལྡན་པ། སྤྱོད་པ་དང་ལྡན་པ། ངོ་ཚ་ཤེས་པ་དང་ལྡན་པ། ཁྲེལ་ཡོད་པ་དང་ལྡན་པ། རྟོགས་པ་དང་ལྡན་པ།
en: The Blessed One replied to Ānanda, “Ānanda, the boys who have arrived from the four directions—whose faces are like the moon, whose radiance surpasses the sun in suffusing the four continents with light—shine with brilliance in form and majesty.

source: བློ་གྲོས་དང་ལྡན་པ། དྲན་པ་དང་ལྡན་པ། བརྟན་པ་དང་ལྡན་པ། ཤེས་རབ་དང་ལྡན་པ། དགེ་བའི་རྣམ་གྲངས་ཀྱི་ཚིག་སྟོན་པ་ལ་མཁས་པ། སངས་རྒྱས་བརྒྱ་ཕྲག་དུ་མ་ལ་དགེ་བའི་རྩ་བ་དག་བསྐྱེད་པ་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དང་གཞན་དག་གི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་དོ་མོད་ནམ་གྱི་ཐུན་ཐ་མ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ང་གྱད་རྣམས་དང་ཉེ་བ་ན་ཡོད་པ་ཤིང་སཱ་ལ་ཟུང་གི་བར་དུ་མཐའ་ལས་འདས་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དང་།
en: They possess the light of insight, they are diligent, they have realized profound wisdom, they are glorious, intelligent, and well behaved, they are conscientious, modest, realized, discerning, mindful, stable, and insightful, they are skilled in expounding virtuous teachings, and they have fostered roots of virtue with many hundreds of buddhas.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དང་། འཇིག་རྟེན་ཐམས་ཅད་དང་མི་འདྲ་བའི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བའི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་ཤེས་པར་དཀའ་བའི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དང་།
en: They have heard, while in the presence of other blessed buddhas, in other buddha fields, that tonight in the last watch of the night, in the country of the Mallas, between a pair of śāla trees, I, the thus-gone, worthy, perfect Buddha, will pass into complete nirvāṇa that is beyond all limits, the parinirvāṇa that is beyond conception, the parinirvāṇa that is unlike anything in all worlds, the parinirvāṇa that outshines anything in all worlds, the parinirvāṇa that brings benefit and wellness to all worlds, the parinirvāṇa that is hard to comprehend in all worlds, the parinirvāṇa that quells imputations in all worlds.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་བཏགས་པ་ཡང་དག་པར་འཇོམས་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བས་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ། །ཞེས་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཐོས་ནས་འཇིག་རྟེན་གྱི་ཁམས་འདིར་སྐྱེས་ཏེ།
en: They have heard that I will pass into parinirvāṇa, so they have taken rebirth here, in this world.

source: ཕྱོགས་བཞི་ཀུན་ནས་འདུག་ཅིང་ངའི་ཡོན་ཏན་བསྔགས་པ་ཡོངས་སུ་བརྗོད་པའི་ཆོས་བསྟན་པ་ཉན་པར་འགྱུར་བ་བཞི་པོ་འདི་དག་མཐོང་ངམ།
en: “Have you seen these four boys who have come here from the four directions to hear my Dharma teachings, whose good qualities are praised and proclaimed in this way?

source: ཀུན་དགའ་བོ་དེ་ལ་གང་ཤར་ཕྱོགས་ནས་འོངས་པའི་ཁྱེའུ་ཁ་དོག་དང་ལྡན་པ། གཟི་བརྗིད་དང་ལྡན་པ། གཟུགས་དང་ལྡན་པ།
en: “Ānanda, the child who came from the east has a good complexion and is bright and handsome.

source: འོད་འབར་བས་གསལ་བ། དཔལ་འབར་བ།
en: He shines with light and blazes with glory.

source: སྲོག་ཆགས་འབུམ་ཕྲག་མང་པོས་ཡོངས་སུ་བསྐོར་ཅིང་ལྷ་འབུམ་གྱིས་རབ་ཏུ་མཆོད་ལ།
en: He is accompanied by many hundreds of thousands of beings and is venerated by a hundred thousand gods.

source: ལྷའི་མེ་ཏོག་གི་ཆར་འབབ་པ་ཉམས་སུ་མྱོང་ཞིང་དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་འོང་བའི་ཁྱེའུ་འདི་ནི་ཀུན་དགའ་བོ་སྔོན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སེང་གེའི་སྒྲ་དབང་ཕྱུག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ན་སྟོང་གི་འཇིག་རྟེན་ལ་དབང་སྒྱུར་ཞིང་ལྷ་དང་མིས་ལེགས་པར་མཆོད་པའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་ཏེ།
en: Ānanda, this child who was showered with divine flowers as he came into the presence of the Thus-Gone One was previously a king in the buddha field of the thus-gone, worthy, perfect buddha Siṃhanādeśvara. He was a universal monarch, venerated by gods and humans, who ruled over a thousand worlds.

source: དེ་རྒྱལ་པོ་བྱེད་པ་ན་འདོད་པ་ན་སྤྱོད་པའི་ལྷ་དང་མི་རྣམས་ལ་ཆོས་སྟོན་ཅིང་ཆོས་ཡང་དག་པར་བགྲོ་བ་ཡང་བྱས་སོ། །
en: During his reign, he taught gods and humans of the desire realm and propagated the Dharma.

source: སྲོག་ཆགས་འབུམ་ཕྲག་མང་པོ་དག་ལ་ཆོས་སྟོན་པ་ན་དགེ་བའི་རྩ་བ་དག་ཡོངས་སུ་སྨིན་པར་བྱེད་ཅིང་མངོན་པར་ཤེས་པ་དག་ལ་མཁས་པ་དང་།
en: When teaching the Dharma to many hundreds of thousands of beings, he caused their roots of virtue to mature, and he was skilled in clairvoyance.

source: ཆོས་ཀྱི་ཚུལ་རྟོགས་པར་ཁོང་དུ་ཆུད་ཅིང་འཕགས་པ་མཐའ་ཡས་པ། རྒྱུན་མི་འཆད་པ། སྣ་ཚོགས་པ། འཇིགས་པ་མེད་པ། དོན་དང་ལྡན་པའི་སྤོབས་པ་དང་ལྡན་ལ།
en: He was a master of the Dharma, penetrating in realization and with an eloquence that was infinitely noble, fluent, diverse, fearless, and meaningful.

source: ཆོས་ཤེས་པ་ལ་མཁས་ཤིང་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པར་གྱུར་ནས་ལོ་བྱེ་བ་ཕྲག་བཅྭ་བརྒྱད་དུ་ཆད་པ་མེད་པ་དང་། མཚོན་ཆ་མེད་པ་དང་།
en: Expert in his knowledge of the Dharma and possessed of perfect wisdom, he served continuously as Dharma king for one hundred eighty million years, without the need for weapons and without harming anyone.

source: སེམས་ཅན་ཐམས་ཅད་ལ་རྣམ་པར་ཐོ་འཚམ་པ་དོན་དུ་མི་གཉེར་བར་ཆོས་ཀྱི་རྒྱལ་པོ་བྱས་སོ། །དེ་ཡང་འདོད་པའི་ཕྱིར་མ་ཡིན་ཞིང་རྒྱལ་སྲིད་ལ་གདུ་བའི་ཕྱིར་མ་ཡིན་གྱི། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་གདགས་པ་དང་ཡོངས་སུ་ཐར་བར་བྱ་བ་དང་།
en: Not driven by desire, and not hankering for power, he ruled for the benefit of all beings who were open to liberation.

source: དུལ་བར་བྱ་བ་དང་། གདུལ་བར་བྱ་བ་དང་། དུལ་བ་དང་།
en: He tamed and trained them so that they were tamed and trained.

source: གདུལ་བར་བྱ་བའི་ཕྱིར་རྒྱལ་པོ་བྱས་ཏེ། དེས་ལོ་བྱེ་བ་ཕྲག་བཅྭ་བརྒྱད་ཀྱིས་སྲོག་ཆགས་ཁྲག་ཁྲིག་ཕྲག་བཅྭ་བརྒྱད་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་ཅིང་ཕྱིར་མི་ལྡོག་པ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: For one hundred eighty million years, he established eighteen hundred billion beings at the level of irreversibility on the path to awakening.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་དང་ལྡན་པ་དང་། སེམས་དང་པོ་བསྐྱེད་པའི་རིགས་ཀྱི་བུ་དེ་དག་ཐམས་ཅད་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པ་ལས་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་རབ་ཏུ་བཀོད་དོ། །
en: He firmly established both those with the qualities of bodhisattvas and those noble sons who had for the first time generated the mind set on awakening at the level of irreversibility from the certain attainment of unsurpassed, completely perfect awakening.

source: དེ་དུས་གཞན་ཞིག་ན་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ། གོས་ངུར་སྨྲིག་དག་བགོས་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་ལེགས་པར་ཁོ་ནར་རབ་ཏུ་བྱུང་ངོ་། །
en: “On another occasion, he shaved his head and facial hair, donned saffron robes, and left his home to live the life of a homeless renunciate.

source: དེ་ལྟར་རབ་ཏུ་བྱུང་ནས་ཀྱང་ལོ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་གཅིག་ཏུ་ཚངས་པར་སྤྱད་པ་སྤྱོད་པ་ན་འདུག་སྟེ་མལ་དུ་ཉལ་བར་ཡང་མི་བྱེད་ན། རྨུགས་པ་དང་གཉིད་ལ་འཇུག་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Having thus gone forth, he lived the life of a dedicated, celibate renunciate for eight hundred ten million years, never even lying on a bed, let alone succumbing to dullness or sleep.

source: དེས་སྔོན་ལོ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་གཅིག་ཏུ་ནམ་ཡང་འདོད་པའི་རྣམ་པར་རྟོག་པའམ། གནོད་སེམས་ཀྱི་རྣམ་པར་རྟོག་པའམ། རྣམ་པར་འཚེ་བའི་རྣམ་པར་རྟོག་པ་མ་བསྐྱེད་དོ། །
en: For the duration of those eight hundred ten million years, he never had a single desirous thought, a single malicious thought, or a single harmful thought.

source: དེའི་བར་དུ་སྔོན་ནམ་ཡང་སྡུག་པར་འདུ་ཤེས་པའམ། མི་སྡུག་པར་འདུ་ཤེས་པའམ། གཙུག་ལག་ཁང་དུ་འདུ་ཤེས་པའམ། གཙུག་ལག་ཁང་མ་ཡིན་པར་འདུ་ཤེས་པ་མེད་ཅིང་། མི་དགེ་བ་ཡིད་ལ་བྱེད་པའི་འདུ་ཤེས་གཞན་འགའ་ཡང་མ་བསྐྱེད་པར་ཆོས་གཉིས་ལ་གནས་པར་གྱུར་ཏེ།
en: During that whole time, he had no notion of attractiveness or repulsiveness, no notion of being in a monastery or not being in a monastery, and without having a single other unvirtuous thought, he remained focused on just two endeavors.

source: གཉིས་གང་ཞེ་ན།
en: What were the two?

source: མིག་མངོན་པར་སྒྲུབ་པ་མེད་པའི་ཚུལ་གྱིས་ཤའི་མིག་མངོན་པར་སྒྲུབ་པ་དང་། དེ་ལ་ཡང་མངོན་པར་ཞེན་པ་མེད་པའི་ཚུལ་གྱིས་ཆོས་ཀྱི་ཕུང་པོའི་དེ་ཁོ་ན་རྗེས་སུ་རྟོགས་པའོ། །
en: To perfect the physical eye with regard to the imperfection of the eye, and to realize the basic reality of the Dharma teachings with no attachment whatsoever.

source: གཞན་ཡང་ལོ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་གཅིག་ཏུ་ནམ་ཡང་སར་འདུ་ཤེས་པའམ། ཆུར་འདུ་ཤེས་པའམ། མེར་འདུ་ཤེས་པའམ། རླུང་དུ་འདུ་ཤེས་པའམ། ནམ་མཁར་འདུ་ཤེས་པའམ། རྣམ་པར་ཤེས་པར་འདུ་ཤེས་པའམ། བུད་མེད་དུ་འདུ་ཤེས་པའམ། སྐྱེས་པར་འདུ་ཤེས་པའམ། བཀྲེས་པར་འདུ་ཤེས་པའམ། སྐོམ་པར་འདུ་ཤེས་པའམ། གྲོང་དུ་འདུ་ཤེས་པའམ། དགོན་པར་འདུ་ཤེས་པའམ། གྲོང་ཁྱེར་དུ་འདུ་ཤེས་པའམ། གྲོང་རྡལ་དུ་འདུ་ཤེས་པའམ། མི་འཐུན་པར་འདུ་ཤེས་པའམ།
en: “Moreover, for the duration of those eight hundred ten million years, he never entertained the notion of earth, the notion of water, the notion of fire, the notion of wind, the notion of space, the notion of consciousness, the notion of woman, the notion of man, the notion of hunger, the notion of thirst, the notion of villages, the notion of wilderness, the notion of cities, the notion of market towns, the notion of disharmony, the notion of harmony, the notion of isolation, the notion of meditation, the notion of self, the notion of other, the notion of form, the notion of formlessness, the notion of end, the notion of middle, the notion of beginning, the notion of ceasing, the notion of less, or the notion of more.

source: མི་འཐུན་པ་མེད་པར་འདུ་ཤེས་པའམ། དབེན་པར་འདུ་ཤེས་པའམ། བསམ་གཏན་དུ་འདུ་ཤེས་པའམ། བདག་ཏུ་འདུ་ཤེས་པའམ། གཞན་དུ་འདུ་ཤེས་པའམ། གཟུགས་སུ་འདུ་ཤེས་པའམ། གཟུགས་མེད་པར་འདུ་ཤེས་པའམ། མཐར་འདུ་ཤེས་པའམ། དབུས་སུ་འདུ་ཤེས་པའམ། སྐྱེ་བར་འདུ་ཤེས་པའམ། འགག་པར་འདུ་ཤེས་པའམ།
en: Nor did he entertain any other notions.

source: ཉུང་ངུར་འདུ་ཤེས་པའམ། མང་པོར་འདུ་ཤེས་པའི་འདུ་ཤེས་གཞན་དག་ཀྱང་མ་བསྐྱེད་དེ། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་མ་གཏོགས་པར་རྣམ་པར་རྟོག་པ་དང་ལྡན་པའི་འདུ་ཤེས་དེ་དག་དང་གཞན་དག་ཀྱང་ཀུན་ཏུ་མི་འབྱུང་བར་གྱུར་ཏོ། །
en: Apart from the teachings of the Bodhisattva Collection, no conceptual notions occurred to him at all.

source: གང་དེའི་བར་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེས་སྲོག་ཆགས་ཁྲག་ཁྲིག་ཕྲག་བརྒྱད་ཅུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེ་དག་ཐམས་ཅད་ནི་སེམས་དང་པོ་བསྐྱེད་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཏེ། དེ་དག་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དང་གཞན་དག་ན་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་སྐད་ཅིག་འདི་ཉིད་མ་ཐལ་བར་འཇིག་རྟེན་གྱི་ཁམས་དེ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་གཉིས་ལྷན་ཅིག་མི་འགྲོགས་པར་འཕགས་ཏེ་དོང་ངོ་། །
en: During that time, the bodhisattva ripened eighty billion beings for unsurpassed, completely perfect awakening, all of whom, by generating the mind set on awakening for the first time, became certain to reach unsurpassed, completely perfect awakening and who, in order to see, revere, and serve blessed buddhas residing in various other buddha fields, were able to travel instantaneously between worlds and buddha fields even when they were not next to one another.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ན་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱང་འདི་ལྟ་སྟེ། དཔེར་ན་ད་ལྟར་དེ་བཞིན་གཤེགས་པ་ང་བཞིན་དུ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་མཚན་འཐུན་པ་ཤ་སྟག་སྟེ། ཐམས་ཅད་ཀྱང་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་འཇིག་རྟེན་དུ་བྱུང་བ་ཤ་སྟག་ཡིན་ནོ། །
en: “And all the blessed buddhas residing in all those buddha fields are thus: Just as I, the Thus-Gone One called Śākyamuni, am alone, all of them are alone in arising in those worlds beset by the five degenerations.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱང་སྐད་ཅིག་དང་། ཐང་ཅིག་དང་། ཡུད་ཙམ་འདི་ཉིད་ལ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཆེན་པོ་ལ་མངོན་པར་ཕྱོགས་ཤིང་སེང་གེའི་གཟིམས་ཁྲི་ལ་སྐུའི་གློ་གཡས་པས་ཕབ་སྟེ་གཟིམས་པར་གྱུར་ཏོ། །
en: And all those blessed buddhas will at the same moment, the same instant, pass into the great parinirvāṇa, having manifestly lain down on their right sides, upon a lion couch.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱང་དོ་མོད་ནམ་གྱི་ཐུན་ཐ་མ་ལ་གྱད་རྣམས་དང་ཉེ་བ་ན་ཡོད་པ་ཤིང་སཱ་ལ་ཟུང་གི་བར་ཤ་སྟག་ཏུ་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ། །
en: Tonight, in the last watch of the night, between a pair of śāla trees in the country of the Mallas, all those blessed buddhas will pass into parinirvāṇa.

source: ཀུན་དགའ་བོ་ངས་ཤའི་སྤྱན་ཐོགས་པ་མེད་པས་གང་དུ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མི་རྟོགས་ཤིང་ཡུལ་མ་ཡིན་ལ་གཏིང་མི་རྟོགས་པ་དེ་དག་དང་།
en: “Ānanda, with my unimpeded eye of flesh, I know that which is not understood by all disciples and solitary buddhas.

source: གཞན་ཡང་ཚད་མེད་པ་དག་རབ་ཏུ་མཁྱེན་ཏོ། །
en: I know that which is beyond their scope and that which they cannot fathom—what I know is limitless.

source: ཀུན་དགའ་བོ་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཐོབ་པར་བྱ་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ངའི་ཤའི་སྤྱན་གྱི་ཐམས་ཅད་མཁྱེན་པ་ལ་དད་པའི་སེམས་སྐྱེད་པར་བྱེད་པ་དང་།
en: Ānanda, in order for those who listen to this prophetic teaching—whether they are monks, nuns, laymen, or laywomen—to attain the wisdom of buddhahood and perfect omniscient wisdom, they must develop faith in the omniscience of my eye of flesh.
